// 1. Code runs as you type: edit message
const PRICE_APPLE = 15.678;
const PRICE_MANGO = 123.965;
const PRICE_BANANA = 90.2345;


//Використовуючи вбудований об'єкт Math – виведіть максимальне число
 console.log(`Самый дорогой товар стоит ${Math.max(PRICE_APPLE,PRICE_MANGO,PRICE_BANANA)}`);
 //Використовуючи вбудований об'єкт Math – виведіть мінімальне число
 console.log(`Самый дешевый товар стоит ${Math.min(PRICE_APPLE,PRICE_MANGO,PRICE_BANANA)}`);

//Складіть вартість всіх товарів, помістіть її в змінну та виведіть цю суму
 const TOTAL_SUM = PRICE_APPLE + PRICE_MANGO + PRICE_BANANA;
 console.log(`Полная стоимость продуктов ${TOTAL_SUM}`);


//Відкиньте копійки у всіх товарів, потім – складіть цілу частину вартості кожного товару між собою. Округлення використовувати в МЕНЬШУ сторону.
const totalSumWithoutBalance = Math.trunc(PRICE_APPLE) + Math.trunc(PRICE_BANANA) + Math.trunc(PRICE_MANGO);
console.log(`Полная сумма товаров без мелочи ${totalSumWithoutBalance}`);

 


//Виведіть суму товарів округлену до сотень. (Наприклад якщо вийшло 260, то виведіть 300)
console.log(`Округленная сумма к сотням ${Math.ceil(totalSumWithoutBalance/100)*100}`);


//Виведіть булеве значення: чи є сума всіх товарів (округлена в меншу сторону) парним чи непарним числом?
console.log( totalSumWithoutBalance%2 === 0);


//Виведіть суму решти, при оплаті всіх товарів (без округлення), якщо клієнт платить 500 грн
console.log(`Клиент заплатил 500 и получил ${(500 - TOTAL_SUM)} сдачи с 500.` );

//Виведіть середнє значення цін, округлене до другого знаку після коми
console.log(`Средняя стоимость товаров ${Math.round((TOTAL_SUM/3)*100)/100}`);

//Створіть змінну, в якої збережіть випадкову знижку (використовуйте функцію Math.random).
const SALE = Math.random()*100;
console.log(`Поздравляю! Вы получили случайную скидку в ${Math.round(SALE)}%`);



/* Зробіть клієнту випадкову знижку та виведіть суму до оплати округлену до 2 знаків після коми.
Виведіть чистий прибуток, якщо клієнт заплатив зі знижкою та собівартість товарів рівно в два рази нижче їх ціни?
(Приклад: ціна була 260.66, знижка склала 10%, клієнт заплатив на 26 меньше, собівартість = 260 / 2 -> 130. Чистий прибуток = 130 - 26 -> 104) (Приклад 2: ціна була 100, знижка склала 90%, клієнт заплатив на 90 меньше, собівартість = 100 / 2 -> 50. Чистий прибуток = 50 - 90 -> -40)*/
console.log(`Клиент купил товар на ${(Math.round(TOTAL_SUM*100)/100)} и получил случайную скидку в ${Math.round(SALE)}% и заплатил на ${(Math.round((Math.round(TOTAL_SUM*100)/100)* Math.round(SALE)/100))} меньше.\n Собестоимость товара равняется ${Math.round(TOTAL_SUM)/2}`);
console.log(`Чистая прибыль равна ${(Math.round(TOTAL_SUM/2)-(Math.round((Math.round(TOTAL_SUM*100)/100)* Math.round(SALE)/100)))}`); 